## Pandas DataFrame manipulation

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [5]:
df

Empty DataFrame
Columns: []
Index: []

In [6]:
df["Food"] = ["Pizza", "Steak", "Nachos", "Salad"]

In [7]:
df["Price"] = [29.99, 49.99, 9.99, 8.99]

In [8]:
df

     Food  Price
0   Pizza  29.99
1   Steak  49.99
2  Nachos   9.99
3   Salad   8.99

In [16]:
df['Qnty'] = 0

In [17]:
df

     Food  Price  Qnty
0   Pizza  29.99     0
1   Steak  49.99     0
2  Nachos   9.99     0
3   Salad   8.99     0

In [18]:
df['Qnty'] = [3, 2, 5, 5]

In [19]:
df

     Food  Price  Qnty
0   Pizza  29.99     3
1   Steak  49.99     2
2  Nachos   9.99     5
3   Salad   8.99     5

In [20]:
df["Price"]

0    29.99
1    49.99
2     9.99
3     8.99
Name: Price, dtype: float64

In [21]:
type(df['Price'])

pandas.core.series.Series

In [22]:
## Series two attributes
### 1. index, 2. values

In [24]:
df["Price"].values

array([29.99, 49.99,  9.99,  8.99])

In [27]:
# Still a series
df["Amnt"] = df["Price"] * df["Qnty"]

In [28]:
## If want to save new result, save expression to a new column (pd.series)

In [29]:
# one dim
df["Price"]

0    29.99
1    49.99
2     9.99
3     8.99
Name: Price, dtype: float64

In [31]:
df['Price'].ndim

1

In [30]:
## Two dimensional
df[['Price']]

   Price
0  29.99
1  49.99
2   9.99
3   8.99

In [37]:
alist = ["Price", "Food"]
df[alist]

   Price    Food
0  29.99   Pizza
1  49.99   Steak
2   9.99  Nachos
3   8.99   Salad

In [33]:
## Double brackets, return a dataframe
df[['Price']].ndim

2

In [35]:
df[['Price', 'Qnty']].ndim

2

In [36]:
df[['Price', 'Qnty', 'Amnt']].ndim

2

### Slice by columns

In [38]:
df.index = df["Food"]

# use strings to attach on top of numerical indices

In [39]:
df

          Food  Price  Qnty   Amnt
Food
Pizza    Pizza  29.99     3  89.97
Steak    Steak  49.99     2  99.98
Nachos  Nachos   9.99     5  49.95
Salad    Salad   8.99     5  44.95

In [40]:
## Axis, inplace
### Axis: df is 2-D, any be applied through rows(0), or columns(1)
### Inplace: True, permanently saves the changes

df.drop("Food", axis=1, inplace=False)

        Price  Qnty   Amnt
Food
Pizza   29.99     3  89.97
Steak   49.99     2  99.98
Nachos   9.99     5  49.95
Salad    8.99     5  44.95

In [41]:
df

          Food  Price  Qnty   Amnt
Food
Pizza    Pizza  29.99     3  89.97
Steak    Steak  49.99     2  99.98
Nachos  Nachos   9.99     5  49.95
Salad    Salad   8.99     5  44.95

In [ ]:
df.drop("Food", axis=1, inplace=True)

## Manipulate by rows

In [42]:
# loc vs iloc
## loc is location, use labels
## iloc is using index

In [43]:
df

          Food  Price  Qnty   Amnt
Food
Pizza    Pizza  29.99     3  89.97
Steak    Steak  49.99     2  99.98
Nachos  Nachos   9.99     5  49.95
Salad    Salad   8.99     5  44.95

In [44]:
df.loc["Steak"]

Food     Steak
Price    49.99
Qnty         2
Amnt     99.98
Name: Steak, dtype: object

In [45]:
df.iloc[1]

Food     Steak
Price    49.99
Qnty         2
Amnt     99.98
Name: Steak, dtype: object

In [46]:
## Stop is not exclusive, when using label,. is N included
df.loc["Steak":"Nachos"]

          Food  Price  Qnty   Amnt
Food
Steak    Steak  49.99     2  99.98
Nachos  Nachos   9.99     5  49.95

In [47]:
df.iloc[1:3]

          Food  Price  Qnty   Amnt
Food
Steak    Steak  49.99     2  99.98
Nachos  Nachos   9.99     5  49.95

In [48]:
df.loc["Steak":"Nachos", "Qnty":"Amnt"]

        Qnty   Amnt
Food
Steak      2  99.98
Nachos     5  49.95

In [49]:
df.iloc[1:3, 1:]

        Price  Qnty   Amnt
Food
Steak   49.99     2  99.98
Nachos   9.99     5  49.95

In [50]:
df[["Price", "Amnt"]].loc["Steak":"Nachos"]

        Price   Amnt
Food
Steak   49.99  99.98
Nachos   9.99  49.95

In [52]:
df.

          Food  Price  Qnty   Amnt
Food
Pizza    Pizza  29.99     3  89.97
Steak    Steak  49.99     2  99.98
Nachos  Nachos   9.99     5  49.95
Salad    Salad   8.99     5  44.95

In [54]:
df.loc["Hamburger"] = ["Hamburger", 5.99, 5, 27.00]

In [55]:
df

                Food  Price  Qnty   Amnt
Food
Pizza          Pizza  29.99     3  89.97
Steak          Steak  49.99     2  99.98
Nachos        Nachos   9.99     5  49.95
Salad          Salad   8.99     5  44.95
Hamburger  Hamburger   5.99     5  27.00

In [56]:
df.drop("Food", inplace=True, axis=1)

In [57]:
df

           Price  Qnty   Amnt
Food
Pizza      29.99     3  89.97
Steak      49.99     2  99.98
Nachos      9.99     5  49.95
Salad       8.99     5  44.95
Hamburger   5.99     5  27.00

In [58]:
df.reset_index(inplace=True)

In [59]:
df

        Food  Price  Qnty   Amnt
0      Pizza  29.99     3  89.97
1      Steak  49.99     2  99.98
2     Nachos   9.99     5  49.95
3      Salad   8.99     5  44.95
4  Hamburger   5.99     5  27.00

In [61]:
df["Price"] ## never use a for loop in pandas

0    29.99
1    49.99
2     9.99
3     8.99
4     5.99
Name: Price, dtype: float64

In [63]:
condition = df["Price"] < 10
df[ condition ]

        Food  Price  Qnty   Amnt
2     Nachos   9.99     5  49.95
3      Salad   8.99     5  44.95
4  Hamburger   5.99     5  27.00

In [65]:
max_Amnt = df["Amnt"].max()

In [66]:
max_Amnt

99.98

In [70]:
df [ df["Amnt"] == max_Amnt ] ["Food"]

1    Steak
Name: Food, dtype: object

### df query
### alternative way, sometimes faster, other times slower
### when sophisticated filtering, >1 conditions, need to break it into steps

In [71]:
df.query( 'Price < 10')

        Food  Price  Qnty   Amnt
2     Nachos   9.99     5  49.95
3      Salad   8.99     5  44.95
4  Hamburger   5.99     5  27.00

In [72]:
df

        Food  Price  Qnty   Amnt
0      Pizza  29.99     3  89.97
1      Steak  49.99     2  99.98
2     Nachos   9.99     5  49.95
3      Salad   8.99     5  44.95
4  Hamburger   5.99     5  27.00

In [74]:
## Practice: get name of the food where quantity is < 5
df[ df['Qnty']<5]["Food"]

0    Pizza
1    Steak
Name: Food, dtype: object

In [77]:
type(df[ df['Qnty']<5]["Food"])

pandas.core.series.Series

### Dataset and read case study

In [78]:
## https://www.sectorspdrs.com/

In [82]:
## File location: https://www.sectorspdrs.com/mainfund/XLF
path = "/Users/huangz36/Downloads/index-holdings-xlf.csv"
df = pd.read_csv(path, skiprows=1)

In [84]:
df.head(2)

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range
0,BRK.b,Berkshire Hathaway B,13.11%,345.35,1.98,+0.58%,2.9 M,259.85 - 344.07
1,JPM,JP Morgan Chase & Co,9.23%,148.15,0.73,+0.50%,11.31 M,101.28 - 149.87

In [88]:
## Read csv from a url

url = "https://artyudinsitemedia.nyc3.cdn.digitaloceanspaces.com/index-holdings-xlf-2.csv"
df = pd.read_csv(url, skiprows=1)

In [90]:
df.head(2)

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range
0,BRK.b,Berkshire Hathaway B,13.11%,345.35,1.98,+0.58%,2.9 M,259.85 - 344.07
1,JPM,JP Morgan Chase & Co,9.23%,148.15,0.73,+0.50%,11.31 M,101.28 - 149.87

In [97]:
### Objects, () vs no "()"
#### Attributes, given, part of dataset, do not need to use ()
##### the 6 attributes do not need a () that are built in from Numpy
#### Methods need to use "()", to invoke the method
####

In [96]:
df.shape

(72, 8)

In [94]:
df.isna().sum()

Symbol           0
Company Name     0
Index Weight     0
Last             0
Change           0
%Change          0
Volume           0
52 Week Range    0
dtype: int64

In [98]:
## Look for Dtype for each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72 entries, 0 to 71
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Symbol         72 non-null     object
 1   Company Name   72 non-null     object
 2   Index Weight   72 non-null     object
 3   Last           72 non-null     float64
 4   Change         72 non-null     float64
 5   %Change        72 non-null     object
 6   Volume         72 non-null     object
 7   52 Week Range  72 non-null     object
dtypes: float64(2), object(6)
memory usage: 4.6+ KB

In [ ]:
## Object means many things, mostly means strings (str), need to clean this data first, may need to convert to numerical

### Clean data

In [99]:
df["Index Weight"]

0     13.11%
1      9.23%
2      8.34%
3      7.13%
4      4.31%
       ...
67     0.17%
68     0.14%
69     0.13%
70     0.10%
71     0.09%
Name: Index Weight, Length: 72, dtype: object

In [100]:
## Clean up ("%") sign

In [106]:
## Option 1
### Apply to series, str is built in pandas
df["IW_1"] = df["Index Weight"].str.strip("%").astype(float)

In [103]:
df["IW_1"]

0     13.11
1      9.23
2      8.34
3      7.13
4      4.31
      ...
67     0.17
68     0.14
69     0.13
70     0.10
71     0.09
Name: IW_1, Length: 72, dtype: float64

#### Apply to only good way to iterate over columns and rows

In [109]:
# Do not use map to slow, use apply (map implemented in pandas)
## Strip applied to string one at a time
df["IW_2"] = df["Index Weight"].apply(lambda x : float(x.strip("%")))

In [110]:
df

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2
0,BRK.b,Berkshire Hathaway B,13.11%,345.35,1.98,+0.58%,2.9 M,259.85 - 344.07,13.11,13.11
1,JPM,JP Morgan Chase & Co,9.23%,148.15,0.73,+0.50%,11.31 M,101.28 - 149.87,9.23,9.23
2,V,Visa Inc A,8.34%,242.21,1.66,+0.69%,6.12 M,174.60 - 250.58,8.34,8.34
3,MA,Mastercard Inc A,7.13%,400.69,2.89,+0.73%,2.27 M,276.87 - 398.46,7.13,7.13
4,BAC,Bank of America Corp,4.31%,29.36,0.34,+1.17%,41.78 M,26.32 - 38.60,4.31,4.31
...,...,...,...,...,...,...,...,...,...,...
67,BEN,Franklin Resources Inc,0.17%,28.43,0.68,+2.45%,3.06 M,20.24 - 34.37,0.17,0.17
68,AIZ,Assurant Inc,0.14%,127.03,0.50,+0.40%,0.39 M,104.49 - 178.76,0.14,0.14
69,CMA,Comerica Inc (MI),0.13%,47.57,1.44,+3.12%,4.35 M,28.40 - 87.02,0.13,0.13
70,ZION,Zions Bancorporation N.A.,0.10%,31.28,0.86,+2.81%,5.96 M,18.26 - 59.75,0.10,0.10
71,LNC,Lincoln National Corp,0.09%,26.21,-0.49,-1.84%,3.99 M,18.50 - 54.59,0.09,0.09

In [114]:
## Find the company with the smallest Index Weight
min_IW1 = df['IW_1'].min()
df[df['IW_1']==min_IW1]['Company Name']

71    Lincoln National Corp
Name: Company Name, dtype: object

In [112]:
min_IW1

0.09

In [116]:
## Describe numerical values

df['IW_1'].describe()

count    72.000000
mean      1.388889
std       2.198419
min       0.090000
25%       0.337500
50%       0.670000
75%       1.525000
max      13.110000
Name: IW_1, dtype: float64

In [119]:
## Build in method for the 3 smallest
df.nsmallest(3, "IW_1")

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2
71,LNC,Lincoln National Corp,0.09%,26.21,-0.49,-1.84%,3.99 M,18.50 - 54.59,0.09,0.09
70,ZION,Zions Bancorporation N.A.,0.10%,31.28,0.86,+2.81%,5.96 M,18.26 - 59.75,0.10,0.10
69,CMA,Comerica Inc (MI),0.13%,47.57,1.44,+3.12%,4.35 M,28.40 - 87.02,0.13,0.13

In [122]:
df.nsmallest(3, "IW_1").count()

Symbol           3
Company Name     3
Index Weight     3
Last             3
Change           3
%Change          3
Volume           3
52 Week Range    3
IW_1             3
IW_2             3
dtype: int64

In [123]:
df.nsmallest(3, "IW_1").count()[0]

3

In [127]:
## Total Volume for all stocks
df["Volume_float"] = df["Volume"].apply(lambda x : float(x.strip("M")))
sum_volume_in_M = df["Volume_float"].sum()

sum_volume_in_M

320.84000000000003

In [130]:
## How many stocks got last price less than $100
df[df['Last']<100]['Symbol'].count()

35

In [134]:
df.query(' Last < 100').count()[0]

35

In [135]:
df.head()

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2,Volume_float
0,BRK.b,Berkshire Hathaway B,13.11%,345.35,1.98,+0.58%,2.9 M,259.85 - 344.07,13.11,13.11,2.90
1,JPM,JP Morgan Chase & Co,9.23%,148.15,0.73,+0.50%,11.31 M,101.28 - 149.87,9.23,9.23,11.31
2,V,Visa Inc A,8.34%,242.21,1.66,+0.69%,6.12 M,174.60 - 250.58,8.34,8.34,6.12
3,MA,Mastercard Inc A,7.13%,400.69,2.89,+0.73%,2.27 M,276.87 - 398.46,7.13,7.13,2.27
4,BAC,Bank of America Corp,4.31%,29.36,0.34,+1.17%,41.78 M,26.32 - 38.60,4.31,4.31,41.78

In [142]:
## What is the last price of a company with Symbol "C"
condition = df['Symbol'].apply(lambda x: x=="C")
df[condition]['Last']

12    47.38
Name: Last, dtype: float64

In [149]:
## Series with only one value
df[df["Symbol"] == "C"]["Last"].iloc[0]

47.38

In [150]:
df[df["Symbol"] == "C"]["Last"].squeeze()

47.38

In [146]:
df[df["Symbol"].str.contains("C")]

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2,Volume_float
4,BAC,Bank of America Corp,4.31%,29.36,0.34,+1.17%,41.78 M,26.32 - 38.60,4.31,4.31,41.78
5,WFC,Wells Fargo & Co,3.43%,43.26,0.52,+1.22%,13.99 M,35.25 - 48.84,3.43,3.43,13.99
11,MMC,Marsh & McLennan Companies,1.98%,186.65,-0.25,-0.13%,1.47 M,146.82 - 189.02,1.98,1.98,1.47
12,C,Citigroup Inc,1.94%,47.38,0.85,+1.83%,17.94 M,40.01 - 54.56,1.94,1.94,17.94
13,SCHW,Charles Schwab Corp,1.83%,58.41,0.83,+1.44%,8.9 M,45.00 - 86.63,1.83,1.83,8.90
14,CB,Chubb Limited,1.70%,190.28,-1.83,-0.95%,2.02 M,173.78 - 231.37,1.70,1.70,2.02
19,CME,CME Group Inc A,1.40%,181.31,-1.02,-0.56%,1.33 M,166.55 - 210.17,1.40,1.40,1.33
20,ICE,Intercontinental Exchange Inc,1.37%,115.38,0.97,+0.85%,1.98 M,88.60 - 114.49,1.37,1.37,1.98
21,MCO,Moody's Corp,1.15%,347.21,7.95,+2.34%,0.89 M,230.16 - 351.06,1.15,1.15,0.89
22,PNC,PNC Finl Services Group,1.08%,127.23,0.74,+0.59%,2.51 M,110.31 - 176.34,1.08,1.08,2.51
25,TFC,Truist Financial Corp,0.93%,33.02,0.54,+1.66%,10.17 M,25.56 - 53.34,0.93,0.93,10.17
26,COF,Capital One Financial,0.92%,112.74,0.54,+0.48%,1.83 M,83.93 - 123.09,0.92,0.92,1.83
29,MSCI,MSCI Inc,0.83%,497.75,11.10,+2.28%,0.5 M,385.00 - 572.50,0.83,0.83,0.50
39,ACGL,Arch Capital Group Ltd,0.61%,76.38,0.46,+0.61%,1.97 M,41.05 - 78.30,0.61,0.61,1.97
53,CINF,Cincinnati Financial Corp,0.34%,99.82,0.22,+0.22%,0.71 M,88.66 - 130.66,0.34,0.34,0.71
58,CBOE,"Cboe Global Markets, Inc",0.31%,136.46,-1.14,-0.83%,0.59 M,114.17 - 140.82,0.31,0.31,0.59
59,CFG,Citizens Financial Group Inc,0.29%,28.11,0.53,+1.92%,6.29 M,23.37 - 44.82,0.29,0.29,6.29
69,CMA,Comerica Inc (MI),0.13%,47.57,1.44,+3.12%,4.35 M,28.40 - 87.02,0.13,0.13,4.35
71,LNC,Lincoln National Corp,0.09%,26.21,-0.49,-1.84%,3.99 M,18.50 - 54.59,0.09,0.09,3.99

In [155]:
## What is the last price of a company with Symbol "C", case sensitive does not work in this way
condition = df['Company Name'].apply(lambda x: "group" in x)
df[condition]

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2,Volume_float
12,C,Citigroup Inc,1.94%,47.38,0.85,+1.83%,17.94 M,40.01 - 54.56,1.94,1.94,17.94

In [157]:
# contains uses Regex
cond_group = df['Company Name'].str.contains("group", case = False)
df[cond_group].count()[0]

11

In [158]:
## What's more popular group or corp

cond_group = df['Company Name'].str.contains("group", case = False)
group_count = df[cond_group].count()[0]

cond_corp = df['Company Name'].str.contains("corp", case = False)
corp_count = df[cond_corp].count()[0]

print(group_count, corp_count)

11 19

In [159]:
df.head()

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2,Volume_float
0,BRK.b,Berkshire Hathaway B,13.11%,345.35,1.98,+0.58%,2.9 M,259.85 - 344.07,13.11,13.11,2.90
1,JPM,JP Morgan Chase & Co,9.23%,148.15,0.73,+0.50%,11.31 M,101.28 - 149.87,9.23,9.23,11.31
2,V,Visa Inc A,8.34%,242.21,1.66,+0.69%,6.12 M,174.60 - 250.58,8.34,8.34,6.12
3,MA,Mastercard Inc A,7.13%,400.69,2.89,+0.73%,2.27 M,276.87 - 398.46,7.13,7.13,2.27
4,BAC,Bank of America Corp,4.31%,29.36,0.34,+1.17%,41.78 M,26.32 - 38.60,4.31,4.31,41.78

In [167]:
## Split "52 Week Range" into "low" and "high"

df["high"] = df["52 Week Range"].apply(lambda x: float(x.split("-")[1]))
df["low"] = df["52 Week Range"].apply(lambda x: float(x.split("-")[0]))

In [176]:
df[["H", "L"]] = df["52 Week Range"].str.split("-", 1, expand = True).astype(float)

In [182]:
pd.to_numeric(df["H"])
pd.to_numeric(df["L"])

0     344.07
1     149.87
2     250.58
3     398.46
4      38.60
       ...
67     34.37
68    178.76
69     87.02
70     59.75
71     54.59
Name: L, Length: 72, dtype: float64

In [183]:
## Apply iterate through one column (all rows)
## Applymap iterate through multiple columns (all rows)
df[["H", "L"]].applymap(pd.to_numeric)

         H       L
0   259.85  344.07
1   101.28  149.87
2   174.60  250.58
3   276.87  398.46
4    26.32   38.60
..     ...     ...
67   20.24   34.37
68  104.49  178.76
69   28.40   87.02
70   18.26   59.75
71   18.50   54.59

[72 rows x 2 columns]

In [177]:
help(df["52 Week Range"].str.split)

Help on method split in module pandas.core.strings.accessor:

split(pat: 'str | re.Pattern | None' = None, n=-1, expand=False, *, regex: 'bool | None' = None) method of pandas.core.strings.accessor.StringMethods instance
    Split strings around given separator/delimiter.

    Splits the string in the Series/Index from the beginning,
    at the specified delimiter string.

    Parameters
    ----------
    pat : str or compiled regex, optional
        String or regular expression to split on.
        If not specified, split on whitespace.
    n : int, default -1 (all)
        Limit number of splits in output.
        ``None``, 0 and -1 will be interpreted as return all splits.
    expand : bool, default False
        Expand the split strings into separate columns.

        - If ``True``, return DataFrame/MultiIndex expanding dimensionality.
        - If ``False``, return Series/Index, containing lists of strings.

    regex : bool, default None
        Determines if the passed-in pattern is a regular expression:

        - If ``True``, assumes the passed-in pattern is a regular expression
        - If ``False``, treats the pattern as a literal string.
        - If ``None`` and `pat` length is 1, treats `pat` as a literal string.
        - If ``None`` and `pat` length is not 1, treats `pat` as a regular expression.
        - Cannot be set to False if `pat` is a compiled regex

        .. versionadded:: 1.4.0

    Returns
    -------
    Series, Index, DataFrame or MultiIndex
        Type matches caller unless ``expand=True`` (see Notes).

    Raises
    ------
    ValueError
        * if `regex` is False and `pat` is a compiled regex

    See Also
    --------
    Series.str.split : Split strings around given separator/delimiter.
    Series.str.rsplit : Splits string around given separator/delimiter,
        starting from the right.
    Series.str.join : Join lists contained as elements in the Series/Index
        with passed delimiter.
    str.split : Standard library version for split.
    str.rsplit : Standard library version for rsplit.

    Notes
    -----
    The handling of the `n` keyword depends on the number of found splits:

    - If found splits > `n`,  make first `n` splits only
    - If found splits <= `n`, make all splits
    - If for a certain row the number of found splits < `n`,
      append `None` for padding up to `n` if ``expand=True``

    If using ``expand=True``, Series and Index callers return DataFrame and
    MultiIndex objects, respectively.

    Use of `regex=False` with a `pat` as a compiled regex will raise
    an error.

    Examples
    --------
    >>> s = pd.Series(
    ...     [
    ...         "this is a regular sentence",
    ...         "https://docs.python.org/3/tutorial/index.html",
    ...         np.nan
    ...     ]
    ... )
    >>> s
    0                       this is a regular sentence
    1    https://docs.python.org/3/tutorial/index.html
    2                                              NaN
    dtype: object

    In the default setting, the string is split by whitespace.

    >>> s.str.split()
    0                   [this, is, a, regular, sentence]
    1    [https://docs.python.org/3/tutorial/index.html]
    2                                                NaN
    dtype: object

    Without the `n` parameter, the outputs of `rsplit` and `split`
    are identical.

    >>> s.str.rsplit()
    0                   [this, is, a, regular, sentence]
    1    [https://docs.python.org/3/tutorial/index.html]
    2                                                NaN
    dtype: object

    The `n` parameter can be used to limit the number of splits on the
    delimiter. The outputs of `split` and `rsplit` are different.

    >>> s.str.split(n=2)
    0                     [this, is, a regular sentence]
    1    [https://docs.python.org/3/tutorial/index.html]
    2                                                NaN
    dtype: object

    >>> s.str.rsplit(n=2)
    0                     [this is a, regular, sentence]
    1    [https://docs.python.org/3/tutorial/index.html]
    2                                                NaN
    dtype: object

    The `pat` parameter can be used to split by other characters.

    >>> s.str.split(pat="/")
    0                         [this is a regular sentence]
    1    [https:, , docs.python.org, 3, tutorial, index...
    2                                                  NaN
    dtype: object

    When using ``expand=True``, the split elements will expand out into
    separate columns. If NaN is present, it is propagated throughout
    the columns during the split.

    >>> s.str.split(expand=True)
                                                   0     1     2        3         4
    0                                           this    is     a  regular  sentence
    1  https://docs.python.org/3/tutorial/index.html  None  None     None      None
    2                                            NaN   NaN   NaN      NaN       NaN

    For slightly more complex use cases like splitting the html document name
    from a url, a combination of parameter settings can be used.

    >>> s.str.rsplit("/", n=1, expand=True)
                                        0           1
    0          this is a regular sentence        None
    1  https://docs.python.org/3/tutorial  index.html
    2                                 NaN         NaN

    Remember to escape special characters when explicitly using regular expressions.

    >>> s = pd.Series(["foo and bar plus baz"])
    >>> s.str.split(r"and|plus", expand=True)
        0   1   2
    0 foo bar baz

    Regular expressions can be used to handle urls or file names.
    When `pat` is a string and ``regex=None`` (the default), the given `pat` is compiled
    as a regex only if ``len(pat) != 1``.

    >>> s = pd.Series(['foojpgbar.jpg'])
    >>> s.str.split(r".", expand=True)
               0    1
    0  foojpgbar  jpg

    >>> s.str.split(r"\.jpg", expand=True)
               0 1
    0  foojpgbar

    When ``regex=True``, `pat` is interpreted as a regex

    >>> s.str.split(r"\.jpg", regex=True, expand=True)
               0 1
    0  foojpgbar

    A compiled regex can be passed as `pat`

    >>> import re
    >>> s.str.split(re.compile(r"\.jpg"), expand=True)
               0 1
    0  foojpgbar

    When ``regex=False``, `pat` is interpreted as the string itself

    >>> s.str.split(r"\.jpg", regex=False, expand=True)
                   0
    0  foojpgbar.jpg

In [179]:
df.head()

,Symbol,Company Name,Index Weight,Last,Change,%Change,Volume,52 Week Range,IW_1,IW_2,Volume_float,high,low,H,L,diff
0,BRK.b,Berkshire Hathaway B,13.11%,345.35,1.98,+0.58%,2.9 M,259.85 - 344.07,13.11,13.11,2.90,344.07,259.85,259.85,344.07,84.22
1,JPM,JP Morgan Chase & Co,9.23%,148.15,0.73,+0.50%,11.31 M,101.28 - 149.87,9.23,9.23,11.31,149.87,101.28,101.28,149.87,48.59
2,V,Visa Inc A,8.34%,242.21,1.66,+0.69%,6.12 M,174.60 - 250.58,8.34,8.34,6.12,250.58,174.60,174.60,250.58,75.98
3,MA,Mastercard Inc A,7.13%,400.69,2.89,+0.73%,2.27 M,276.87 - 398.46,7.13,7.13,2.27,398.46,276.87,276.87,398.46,121.59
4,BAC,Bank of America Corp,4.31%,29.36,0.34,+1.17%,41.78 M,26.32 - 38.60,4.31,4.31,41.78,38.60,26.32,26.32,38.60,12.28

In [180]:
df["diff"] = abs(df["low"] - df["high"])

In [181]:
df["H"].dtype

dtype('float64')

### Concat and merge files and deal with missing values

In [184]:
import pandas as pd

In [185]:
food = pd.DataFrame()
food["People"] = ["Mark", "Mary", "John"]
food["Food"] = ["Steak", "Salad", "Pizza"]

In [191]:
drink = pd.DataFrame()
drink["Friends"] = ["John", "Mary"]
drink["Drink"] = ["Wine", "Vodka"]

In [187]:
## Concat and Merge

In [188]:
food

  People   Food
0   Mark  Steak
1   Mary  Salad
2   John  Pizza

In [197]:
pd.concat([food, drink], ignore_index=True)
v = pd.concat([food, drink], axis=0)
v.reset_index()
# avoid overlapping values in the index

   index People   Food Friends  Drink
0      0   Mark  Steak     NaN    NaN
1      1   Mary  Salad     NaN    NaN
2      2   John  Pizza     NaN    NaN
3      0    NaN    NaN    John   Wine
4      1    NaN    NaN    Mary  Vodka

In [199]:
pd.concat([food, drink], axis=1)

## NaN stands for "Not a Number"

  People   Food Friends  Drink
0   Mark  Steak    John   Wine
1   Mary  Salad    Mary  Vodka
2   John  Pizza     NaN    NaN

In [202]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left: 'DataFrame | Series', right: 'DataFrame | Series', how: 'str' = 'inner', on: 'IndexLabel | None' = None, left_on: 'IndexLabel | None' = None, right_on: 'IndexLabel | None' = None, left_index: 'bool' = False, right_index: 'bool' = False, sort: 'bool' = False, suffixes: 'Suffixes' = ('_x', '_y'), copy: 'bool' = True, indicator: 'bool' = False, validate: 'str | None' = None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    A named Series object is treated as a DataFrame with a single named column.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.
    When performing a cross merge, no column specifications to merge on are
    allowed.

    .. warning::

        If both key columns contain rows where the key is a null value, those
        rows will be matched against each other. This is different from usual SQL
        join behaviour and can lead to unexpected results.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
        * cross: creates the cartesian product from both frames, preserves the order
          of the left keys.

          .. versionadded:: 1.2.0

    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : list-like, default is ("_x", "_y")
        A length-2 sequence where each element is optionally a string
        indicating the suffix to add to overlapping column names in
        `left` and `right` respectively. Pass a value of `None` instead
        of a string to indicate that the column name from `left` or
        `right` should be left as-is, with no suffix. At least one of the
        values must not be None.
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to the output DataFrame called "_merge" with
        information on the source of each row. The column can be given a different
        name by providing a string argument. The column will have a Categorical
        type with the value of "left_only" for observations whose merge key only
        appears in the left DataFrame, "right_only" for observations
        whose merge key only appears in the right DataFrame, and "both"
        if the observation's merge key is found in both DataFrames.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------
    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

    >>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
    >>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
    >>> df1
          a  b
    0   foo  1
    1   bar  2
    >>> df2
          a  c
    0   foo  3
    1   baz  4

    >>> df1.merge(df2, how='inner', on='a')
          a  b  c
    0   foo  1  3

    >>> df1.merge(df2, how='left', on='a')
          a  b  c
    0   foo  1  3.0
    1   bar  2  NaN

    >>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
    >>> df2 = pd.DataFrame({'right': [7, 8]})
    >>> df1
        left
    0   foo
    1   bar
    >>> df2
        right
    0   7
    1   8

    >>> df1.merge(df2, how='cross')
       left  right
    0   foo      7
    1   foo      8
    2   bar      7
    3   bar      8

In [205]:
m = pd.merge(left=food, right=drink, left_on = "People", right_on = "Friends", how="outer")

In [206]:
m.isna().any()

People     False
Food       False
Friends     True
Drink       True
dtype: bool

In [208]:
m.isna().sum()

People     0
Food       0
Friends    1
Drink      1
dtype: int64

In [209]:
m.isna().all()

People     False
Food       False
Friends    False
Drink      False
dtype: bool

In [210]:
m.dropna()

  People   Food Friends  Drink
1   Mary  Salad    Mary  Vodka
2   John  Pizza    John   Wine

In [213]:
m['Drink'] = m['Drink'].fillna("Water")

In [214]:
m

  People   Food Friends  Drink
0   Mark  Steak     NaN  Water
1   Mary  Salad    Mary  Vodka
2   John  Pizza    John   Wine

In [221]:
##

## For pandas, Is there any easy way to memorize when to use object.function() or pd.function(object)? 
## Same question for numpy.

## function
word = "apple"
len(word)

## method
dir(word) ## check if a method exist?

## The dir() function returns all properties and methods of the specified object

['__add__',
 '__class__',
 '__contains__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getnewargs__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rmod__',
 '__rmul__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'capitalize',
 'casefold',
 'center',
 'count',
 'encode',
 'endswith',
 'expandtabs',
 'find',
 'format',
 'format_map',
 'index',
 'isalnum',
 'isalpha',
 'isascii',
 'isdecimal',
 'isdigit',
 'isidentifier',
 'islower',
 'isnumeric',
 'isprintable',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'ljust',
 'lower',
 'lstrip',
 'maketrans',
 'partition',
 'removeprefix',
 'removesuffix',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'split',
 'splitlines',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'zfill']

In [217]:
word.__len__()

5

In [218]:
print(dir(word))

['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'capitalize', 'casefold', 'center', 'count', 'encode', 'endswith', 'expandtabs', 'find', 'format', 'format_map', 'index', 'isalnum', 'isalpha', 'isascii', 'isdecimal', 'isdigit', 'isidentifier', 'islower', 'isnumeric', 'isprintable', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'maketrans', 'partition', 'removeprefix', 'removesuffix', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']

In [220]:
import numpy as np